In [1]:
import warnings
warnings.filterwarnings('ignore')

import numpy as np
import pandas as pd

# Create a dictionary with three keys, 'A', 'B', and 'C', and lists of 10 numbers as values
data = {'A': list(range(10)),
        'B': list(range(10, 20)),
        'C': list(range(20, 30))}

# Convert the dictionary to a pandas DataFrame
df1 = pd.DataFrame(data)

# Print the DataFrame
df = df1.head()
df

   A   B   C
0  0  10  20
1  1  11  21
2  2  12  22
3  3  13  23
4  4  14  24

In [ ]:
Extract the value from the first row and the first column.
Retrieve the second row of the DataFrame.
Retrieve the third column of the DataFrame.
Extract the last two rows of the DataFrame.
Retrieve the value from the second row and the third column.
Extract the first two rows and the first and third columns.
Retrieve the last column of the DataFrame.
Extract rows from the third to the fifth (inclusive) and the first and third columns.
Extract the last two rows and the last two columns.
Retrieve the third row of the DataFrame.
Extract the first three rows of the DataFrame.
Retrieve the last two values of the last column.
Extract rows with indices 1 and 3 from the DataFrame.
Retrieve the first three rows and the first and third columns.
Extract the last row of the DataFrame.

In [9]:
#1

df.iloc[0, 0]

0

In [10]:
#2
df.iloc[1, :]

A     1
B    11
C    21
Name: 1, dtype: int64

In [11]:
#3
df.iloc[:, 2]

0    20
1    21
2    22
3    23
4    24
Name: C, dtype: int64

In [12]:
#4
df.iloc[-2:, ]

   A   B   C
3  3  13  23
4  4  14  24

In [13]:
#5
df.iloc[1, 2]

21

In [15]:
#6
df.iloc[:2, [0, 2]]

   A   C
0  0  20
1  1  21

In [16]:
#7
df.iloc[:, -1]

0    20
1    21
2    22
3    23
4    24
Name: C, dtype: int64

In [17]:
#8
df.iloc[2:5, [0, 2]]

   A   C
2  2  22
3  3  23
4  4  24

In [19]:
#9
df.iloc[-2:, -2:]

    B   C
3  13  23
4  14  24

In [24]:
#10 
df.iloc[2, ] # this is better than df.iloc[2]

A     2
B    12
C    22
Name: 2, dtype: int64

In [27]:
#11
df.iloc[:, [0, 2]]

   A   C
0  0  20
1  1  21
2  2  22
3  3  23
4  4  24

In [29]:
#12
df.iloc[-1, ]

A     4
B    14
C    24
Name: 4, dtype: int64

In [30]:
#13 
df.iloc[:2, -1]

0    20
1    21
Name: C, dtype: int64

In [31]:
#14
df.iloc[[1, 3], ]

   A   B   C
1  1  11  21
3  3  13  23

In [32]:
#15
df.iloc[:3, [0, 2]]

   A   C
0  0  20
1  1  21
2  2  22